// Задача 66: Задайте значения M и N. 
// Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.
/*
Console.WriteLine();

        int start = 1;
        int finish = 7;
        int sum = 0;
        Console.WriteLine("Начало отрезка: " + start);
        Console.WriteLine("Конец отрезка: " + finish);
        while (start <= finish)
        {
            sum += start;
            start++;
        }
        Console.WriteLine("Сумма элементов равна " + sum);
*/
        
        